In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv('datasets/orders.csv')
time = pd.read_csv('datasets/messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

# Working with Dates

In [7]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## 1. Extract Year

In [10]:
date['date_year'] = date['date'].dt.year
date.sample(5)

          date  product_id  city_id  orders  date_year
812 2019-03-28        1719        2      79       2019
265 2019-04-28        2850       16       6       2019
765 2018-11-01        3913       13       7       2018
191 2018-09-29        2228        5       3       2018
32  2018-10-23        2845       23       1       2018

## 2. Extract Month

In [11]:
date['date_month'] = date['date'].dt.month
date.sample(5)

          date  product_id  city_id  orders  date_year  date_month
801 2018-12-17         630       10      12       2018          12
699 2018-10-06        1160       13       6       2018          10
716 2018-11-02         888       20       8       2018          11
631 2019-06-30        4323        4       7       2019           6
837 2018-12-15        5407       13      68       2018          12

In [12]:
date['date_month_time'] = date['date'].dt.month_name()
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_time
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

## 3. Extract Days

In [13]:
date['date_day'] = date['date'].dt.day
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_time,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [14]:
# DAY OF THE WEEK
date['date_dow'] = date['date'].dt.dayofweek
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_time,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [16]:
# day of week -name 
date['date_dow_name'] = date['date'].dt.day_name()
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_time,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [17]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday','Saturday']),1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_time,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

## 4. Extact week of the year

In [20]:
## week is depricated from pandas 
date['date_week'] = date['date'].dt.week

date.drop(columns=['product_id','city_id','orders']).head()

AttributeError: 'Series' object has no attribute 'isocalendar'

## 5. Extract Quarter

In [21]:
date['quater'] = date['date'].dt.quater
date.drop(columns=['product_id','city_id','orders']).head()

AttributeError: 'DatetimeProperties' object has no attribute 'quater'

In [ ]:

##  Extract Semester
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id','city_id','orders']).head()

## 6. Extract the Time elapsed between dates

In [23]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2025, 4, 3, 12, 42, 1, 806760)

In [24]:
today-date['date']

0     1941 days 12:42:01.806760
1     2423 days 12:42:01.806760
2     2354 days 12:42:01.806760
3     2056 days 12:42:01.806760
4     2279 days 12:42:01.806760
                 ...
995   2369 days 12:42:01.806760
996   2310 days 12:42:01.806760
997   2158 days 12:42:01.806760
998   2223 days 12:42:01.806760
999   1997 days 12:42:01.806760
Name: date, Length: 1000, dtype: timedelta64[ns]

In [25]:
# in terms of days
(today-date['date']).dt.days

0      1941
1      2423
2      2354
3      2056
4      2279
       ...
995    2369
996    2310
997    2158
998    2223
999    1997
Name: date, Length: 1000, dtype: int64

In [30]:
# Months passes

np.round((today -date['date']) / np.timedelta64(1, 'm'),0)

0      2795802.0
1      3489882.0
2      3390522.0
3      2961402.0
4      3282522.0
         ...
995    3412122.0
996    3327162.0
997    3108282.0
998    3201882.0
999    2876442.0
Name: date, Length: 1000, dtype: float64

# Time

In [31]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [32]:
# Converting the datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [33]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [35]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

## Extract Time Part

In [36]:
time['time'] = time['date'].dt.time
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

## Time Difference

In [37]:
today-time['date']

0     4127 days 11:52:01.806760
1     3991 days 13:02:01.806760
2     4477 days 12:21:01.806760
3     3779 days 12:11:01.806760
4     4176 days 13:31:01.806760
                 ...
995   4766 days 11:52:01.806760
996   4087 days 13:28:01.806760
997   4552 days 13:05:01.806760
998   4668 days 13:08:01.806760
999   3940 days 13:17:01.806760
Name: date, Length: 1000, dtype: timedelta64[ns]

In [40]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.566155e+08
1      3.448693e+08
2      3.868573e+08
3      3.265495e+08
4      3.608551e+08
           ...
995    4.118251e+08
996    3.531653e+08
997    3.933399e+08
998    4.033625e+08
999    3.404638e+08
Name: date, Length: 1000, dtype: float64

In [41]:
(today - time['date'])/np.timedelta64(1,'m')

0      5.943592e+06
1      5.747822e+06
2      6.447621e+06
3      5.442491e+06
4      6.014251e+06
           ...
995    6.863752e+06
996    5.886088e+06
997    6.555665e+06
998    6.722708e+06
999    5.674397e+06
Name: date, Length: 1000, dtype: float64

In [42]:
(today - time['date'])/np.timedelta64(1,'h')

0       99059.867169
1       95797.033835
2      107460.350502
3       90708.183835
4      100237.517169
           ...
995    114395.867169
996     98101.467169
997    109261.083835
998    112045.133835
999     94573.283835
Name: date, Length: 1000, dtype: float64

In [ ]:
df